'''
5. Универсум

Написать программу для вычисления последней цифры суммы квадратов чисел Фибоначчи: ((F_0)^2 + (F_1)^2 + ... + (F_n)^2) mod 10.

Формат ввода
Целое число n (от 0 до 10^15).

Формат вывода
Целое число: ((F_0)^2 + (F_1)^2 + ... + (F_n)^2) mod 10.
'''
def f(n):

    root_5 = 5**0.5
    phi = ((1 + root_5) / 2)
    phi1 = ((1-root_5) / 2)

    a = ((phi**n) - (phi1**n)) / root_5
    
    return round(a)
def fl(n):
    s = (n + 2)%60
    s = (f(s)-1)%10
    return s
def fs(n):
    return ((f((n+1)%60))%10 * (f(n%60))%10)%10 
n = int(input())



print(fs(n))

